/*
        Написать запрос, который выводит общее число тегов
*/
print("tags count: ", 'расчёт количества тегов');
/*
        Добавляем фильтрацию: считаем только количество тегов woman
*/
print("woman tags count: ", 'расчёт количества тегов woman');
/*
        Очень сложный запрос: используем группировку данных посчитать количество вхождений для каждого тега
        и напечатать top-3 самых популярных
*/

printjson(
        db.tags.aggregate([
                {"$group": {
                                "--": "--",
                                "--": "--"
                           }
                },
                {"тут модификатор sort по полю с аггрегацией"},
                {$limit: 3}
        ])['_batch']
);
